#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.asg.aws_key_pair.terraform: Refreshing state... [id=aws_key_pair]
module.asg.aws_security_group.asg: Refreshing state... [id=sg-03ab1b80d6a8816ca]
module.asg.data.aws_vpc.default: Reading...
module.asg.aws_security_group.alb: Refreshing state... [id=sg-0364227f4a6183f9c]
module.asg.aws_launch_configuration.example: Refreshing state... [id=terraform-20230902191500554800000002]
module.ec2-instance.aws_security_group.instance: Refreshing state... [id=sg-09761c58795881557]
module.asg.data.aws_vpc.default: Read complete after 1s [id=vpc-2a7d1051]
module.asg.data.aws_subnets.default: Reading...
module.asg.aws_lb_target_group.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:374766630388:targetgroup/tf-20230902191458056600000001/dc5b85a8263d09f8]
module.asg.data.aws_subnets.default: Read complete after 0s [id=us-east-1]
module.asg.aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:374766630388:loadbalancer/app/tf-lb-20230902191500557700000003/afba347555435b31]
module.asg.aws_autoscaling_group.example: Refreshing state... [id=terraform-20230902191501408500000004]
module.asg.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:374766630388:listener/app/tf-lb-20230902191500557700000003/afba347555435b31/327728b62edf80b2]
module.asg.aws_lb_listener_rule.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:374766630388:listener-rule/app/tf-lb-20230902191500557700000003/afba347555435b31/327728b62edf80b2/7a15027e02e2c741]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.asg.aws_lb.example has been deleted
  - resource "aws_lb" "example" {
      - arn                                         = "arn:aws:elasticloadbalancing:us-east-1:374766630388:loadbalancer/app/tf-lb-20230902191500557700000003/afba347555435b31" -> null
      - dns_name                                    = "tf-lb-20230902191500557700000003-921967466.us-east-1.elb.amazonaws.com" -> null
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:374766630388:loadbalancer/app/tf-lb-20230902191500557700000003/afba347555435b31"
        name                                        = "tf-lb-20230902191500557700000003"
        # (20 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.asg.aws_lb_listener.http has been deleted
  - resource "aws_lb_listener" "http" {
      - arn               = "arn:aws:elasticloadbalancing:us-east-1:374766630388:listener/app/tf-lb-20230902191500557700000003/afba347555435b31/327728b62edf80b2" -> null
        id                = "arn:aws:elasticloadbalancing:us-east-1:374766630388:listener/app/tf-lb-20230902191500557700000003/afba347555435b31/327728b62edf80b2"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.asg.aws_lb_target_group.asg has been deleted
  - resource "aws_lb_target_group" "asg" {
      - arn                                = "arn:aws:elasticloadbalancing:us-east-1:374766630388:targetgroup/tf-20230902191458056600000001/dc5b85a8263d09f8" -> null
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:374766630388:targetgroup/tf-20230902191458056600000001/dc5b85a8263d09f8"
        name                               = "tf-20230902191458056600000001"
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.asg.aws_security_group.alb has been deleted
  - resource "aws_security_group" "alb" {
      - id                     = "sg-0364227f4a6183f9c" -> null
        name                   = "terraform-example-alb"
        # (8 unchanged attributes hidden)
    }

  # module.asg.aws_security_group.asg has been deleted
  - resource "aws_security_group" "asg" {
      - id                     = "sg-03ab1b80d6a8816ca" -> null
        name                   = "terraform-example-asg"
        # (8 unchanged attributes hidden)
    }

  # module.ec2-instance.aws_security_group.instance has been deleted
  - resource "aws_security_group" "instance" {
      - id                     = "sg-09761c58795881557" -> null
        name                   = "terraform-example-instance"
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.example will be created
  + resource "aws_autoscaling_group" "example" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + launch_configuration             = (known after apply)
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-2ad7d877",
          + "subnet-8b444da4",
          + "subnet-9b04b094",
          + "subnet-b401e7d3",
          + "subnet-b8cd1ef2",
          + "subnet-df91a2e0",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "terraform_asg"
        }
    }

  # module.asg.aws_launch_configuration.example must be replaced
+/- resource "aws_launch_configuration" "example" {
      ~ arn                         = "arn:aws:autoscaling:us-east-1:374766630388:launchConfiguration:26745998-3404-4093-8fb7-033b488471d0:launchConfigurationName/terraform-20230902191500554800000002" -> (known after apply)
      ~ associate_public_ip_address = false -> (known after apply)
      ~ ebs_optimized               = false -> (known after apply)
      ~ id                          = "terraform-20230902191500554800000002" -> (known after apply)
      ~ name                        = "terraform-20230902191500554800000002" -> (known after apply)
      ~ name_prefix                 = "terraform-" -> (known after apply)
      ~ security_groups             = [ # forces replacement
          - "sg-03ab1b80d6a8816ca",
        ] -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.asg.aws_lb.example will be created
  + resource "aws_lb" "example" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = (known after apply)
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-2ad7d877",
          + "subnet-8b444da4",
          + "subnet-9b04b094",
          + "subnet-b401e7d3",
          + "subnet-b8cd1ef2",
          + "subnet-df91a2e0",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # module.asg.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "404: page not found"
              + status_code  = "404"
            }
        }
    }

  # module.asg.aws_lb_listener_rule.asg will be created
  + resource "aws_lb_listener_rule" "asg" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # module.asg.aws_lb_target_group.asg will be created
  + resource "aws_lb_target_group" "asg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-2a7d1051"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 15
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # module.asg.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "terraform-example-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.asg.aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "terraform-example-asg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.ec2-instance.aws_instance.example will be created
  + resource "aws_instance" "example" {
      + ami                                  = "ami-0889a44b331db0194"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "aws_key_pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "d322681e58733e0e721128c84c5ea77a5210da73"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # module.ec2-instance.aws_key_pair.terraform will be created
  + resource "aws_key_pair" "terraform" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "aws_key_pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDBGrHCC95QsUPZozICYflAVpTHe0gcBUDklM3CYmYqUvwHXNSRoZEQWv+HMMNHAekDg3UKG27l+mYCqHiOOHMCmNjPBa6JvwBHTlBI0MHnZao2IZbRph72+3BQ3tIErXQeHhcgjbqQYMsrJRNqof4kUzNztQc6eKWyrMPWtgN7KmhU4efA03tsEwM2cl89YKHxAh5BkKIgbwPXwWyRCSl8N/cBgDNXA3rtHw/gAzunBW2GpB4CQekng9ddShOzn5vgs4ODoDOvyHSl1boj2cMu3/R95c8VgsralyobQ6s4NN7WhjtJmfumbz5kAfD4zAu3UFm5JJBRhjv7hLXIkrq7LKGpgoGkPEGKV01pK61sSYEngesZ3knjQXWanmJqbLdHhH+pzZG2zmGeI5BzOsHuSPdA9+pPXO/glZg5zK8aiSAWjmNGcPS1h1Tfbz4zk8fSGYL7HB0vTVOt4GPkwv9MEUr/hZUsJ+uk1G4t6lrglgrqCY3UvT0JXh0etlPWrtREtYXNYLOoYM44IcJKWGeLSjyIpe0IVyNldvdfWiJe5fnabmCIJhOaep2xClMuCqhkpBIVpzLFcEEqupGoJSH0G5i8xlQ/V9C5mL4xuF3IN1ah+gHNqb4PXGxXpSCxfE3jmgBG0GcBymQPONnjPjOiMwRvx6qCbowhQ+LdyxVfmQ== tarpanpathak720@gmail.com"
      + tags_all        = (known after apply)
    }

  # module.ec2-instance.aws_security_group.instance will be created
  + resource "aws_security_group" "instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "terraform-example-instance"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 11 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ alb_dns_name    = "curl http://curl http://tf-lb-20230902191500557700000003-921967466.us-east-1.elb.amazonaws.com" -> (known after apply)
  + ec2_instance_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @duttpathak, Action: `pull_request`*